[
  {
    "id": 1,
    "content": "I see Mohamed is a good learner, he does his searches and investigation very well. His communication is good and always makes sure he understands the tasks clearly and every detail of the overall project.",
    "date": "Aug 2024"
  },
  {
    "id": 2,
    "content": "I like how fast Mohamed is able to find root causes of issues when bugs appear, and also planning effective solutions.",
    "date": "Sep 2024"
  },
  {
    "id": 3,
    "content": "Thank you, brother, for helping me choose a mini PC 😄",
    "date": "Nov 2024"
  },
  {
    "id": 4,
    "content": "Mohamed works professionally. His messages and daily reports are always clear and detailed. From his daily reports, I can tell he works hard and tries to learn as much as possible. He proactively helps his teammates by sharing his knowledge. Also, communication with him is clear. in conclusion, he is doing a great job!",
    "date": "Nov 2024"
  },
  {
    "id": 5,
    "content": "always pays attention to details, always noting instructions and aware to not fail in same mistakes",
    "date": "Nov 2024"
  },
  {
    "id": 6,
    "content": "Thanks for being a great teammate! Best regards. Reza",
    "date": "Nov 2024"
  },
  {
    "id": 7,
    "content": "Thanks for helping me ❤",
    "date": "Dec 2024"
  },
  {
    "id": 8,
    "content": "Congrats on stepping into the TL role and doing it by the book! Let's see what awesome things we can do together. P.S. Your feedback is invaluable!!!",
    "date": "Jan 2025"
  },
  {
    "id": 9,
    "content": "Mohamed has shown remarkable improvements recently. his ability to adapt and deliver quality work consistently has been impressive, and he's becoming someone we can rely on.",
    "date": "Feb 2025"
  },
  {
    "id": 10,
    "content": "Mohamed consistently delivers high-quality work on time, handling complex tasks efficiently.  He manages his workload effectively and makes informed decisions with minimal supervision. Mohamed communicates clearly and keeps the team updated, ensuring smooth collaboration. He takes initiative in solving problems and leads tasks to contribute to team success. Mohamed approaches his work with professionalism, dedication, and a positive attitude.",
    "date": "Feb 2025"
  },
  {
    "id": 11,
    "content": "In the past 3 months I was working with Mohamed on Satoshi project. he proactively finds bugs and discusses them on DS. he is easily reachable during working hours. the way he works is so professional. I like his communication and reports, as they are so clear and full of details. also he is open to helping others when we reach out to him with a question.",
    "date": "Feb 2025"
  },
  {
    "id": 12,
    "content": "Thank you so much for all the help, support, and kind words of encouragement. It truly means a lot as I start my journey in the corporate world.",
    "date": "Mar 2025"
  },
  {
    "id": 13,
    "content": "Thank you for all the work you do on JR Dunn!",
    "date": "Mar 2025"
  },
  {
    "id": 14,
    "content": "stay positive, you are doing great",
    "date": "Mar 2025"
  },
  {
    "id": 15,
    "content": "Keep creating that amazing community, I'm really glad to see your team work together!",
    "date": "Mar 2025"
  },
  {
    "id": 16,
    "content": "💎You are a gem in JRDUNN project!",
    "date": "Apr 2025"
  },
  {
    "id": 17,
    "content": "Great work on jrdunn!",
    "date": "Apr 2025"
  },
  {
    "id": 18,
    "content": "Hey Idris, here's a gift, thank you for good communication!",
    "date": "Apr 2025"
  },
  {
    "id": 19,
    "content": "Thanks my friend for guiding me in my new project.🤝🤝🤙",
    "date": "Apr 2025"
  },
  {
    "id": 20,
    "content": "Thanks for all your help ya sadeky 💙",
    "date": "Apr 2025"
  },
  {
    "id": 21,
    "content": "Best TL! Thanks for your help on the project!",
    "date": "Apr 2025"
  },
  {
    "id": 22,
    "content": "I want to sincerely thank you for all the help, instructions, and goodwill you have shown in supporting me and training me for the team lead position. I really appreciate your guidance and patience throughout this process.",
    "date": "May 2025"
  },
  {
    "id": 23,
    "content": "Thank you so much for your help and for taking the time to clarify things for me",
    "date": "May 2025"
  },
  {
    "id": 24,
    "content": "Thanks for the explanations and patience!💎",
    "date": "May 2025"
  },
  {
    "id": 25,
    "content": "Siuuu for impresive TL work!🚀🚀🚀",
    "date": "May 2025"
  },
  {
    "id": 26,
    "content": "Great job on JR Dunn! You're an awesome TL, keep going!",
    "date": "May 2025"
  },
  {
    "id": 27,
    "content": "Thanks my friend for being quick responsive and patient really have good future.✌🤝🤝",
    "date": "May 2025"
  },
  {
    "id": 28,
    "content": "I guess the only thing that Idris needs now is more self-esteem, and that will come with experience.",
    "date": "May 2025"
  },
  {
    "id": 29,
    "content": "Idris has done a good job moving into his new team lead role. I can see that he's trying to learn and grow, and I really respect that. He's motivated and wants to improve, and that's always a good sign in a leader.",
    "date": "May 2025"
  },
  {
    "id": 30,
    "content": "Absolutely awesome. I'm very lucky to work with Idris, he's just great, polite, concrete, very easy to reach and understand. Everyone had very nice reviewes about him. The quality of the project is very good so far, he's doing an amazing job with CRs and with general dev workflow. He's very easy-going and pro-active, creates great working environment in the team, one of devs told me that I want to start the work when I wake up', and Idris is one of the reasons for that.",
    "date": "May 2025"
  },
  {
    "id": 31,
    "content": "Mohammed has done a great job leading his team, creating a collaborative and supportive environment. He has also grown more confident in his new team leader role, adapting well and performing quite good on his first project in this role.",
    "date": "May 2025"
  },
  {
    "id": 32,
    "content": "In the past three months, Mohamed has been very good at: Communication: Mohamed has effectively expressed his ideas, expressed concerns when needed, and provided constructive feedback during team discussions. He ensures that everyone involved in the project is also kept informed. Attitude to Change: He has shown a positive attitude towards change, embracing ideas or best practices. Mohamed is open to learning and adapts well, showing flexibility. Reliability: Mohamed is reliable regarding advice and help, being there when it matters. Independence: He has demonstrated strong independence in the last 3 months.",
    "date": "May 2025"
  },
  {
    "id": 33,
    "content": "Wishing you the best, Mohamed! Thanks for your great work on Satoshi!",
    "date": "June 2025"
  },
  {
    "id": 34,
    "content": "Thanks for your exceptional leading to the team 💙💙",
    "date": "June 2025"
  },
  {
    "id": 35,
    "content": "Good luck my friend really best team leader ✌🤝💪",
    "date": "June 2025"
  },
  {
    "id": 36,
    "content": "Good job with TL,",
    "date": "June 2025"
  },
  {
    "id": 37,
    "content": "Idris has been an exceptional leader in the JRDUNN project,despite being his first shopify project,he is always taking the initiative to find the best way to solve tasks and always shares this information in the project channel. He also displays great leadership and excellent communication, proactively helping developers get unblocked and thus raising team spirit. Idris has been an inspiration and good example for us developers",
    "date": "July 2025"
  },
  {
    "id": 38,
    "content": "Mohamed Idris is the essence of what makes our team thrive. As a team leader, he’s not just humble and kind but also incredibly hardworking and proactive. He always makes sure no one is left behind, and his door is never closed—whether it’s for brainstorming a solution or lending a hand, he’s always there. It’s rare to find a leader who’s so dedicated to ensuring the team succeeds, and Mohamed consistently goes above and beyond to make sure the project stays on track.\nHis ability to dig deep into problems, research best practices, and share his knowledge with the rest of the team has been invaluable. He doesn’t just focus on his own growth; he’s always encouraging and empowering the team with new insights, tools, and techniques that help us all improve.\nWhat stands out the most is his proactive nature. He never waits for problems to solve themselves. Instead, he takes ownership and works tirelessly to find solutions, no matter how complex the challenge is. Whether it’s improving his Shopify skills or tackling new tasks, he’s always pushing himself to grow and encouraging the rest of the team to do the same.\nOverall, Mohamed truly embodies the qualities of a leader who leads by example—not just in his technical abilities, but in his approach to collaboration, communication, and continuous improvement.",
    "date": "July 2025"
  },
  {
    "id": 39,
    "content": "Mohamed is an outstanding Team Lead and a highly skilled problem solver. During code reviews, he consistently identifies and addresses issues in others' code, ensuring that past mistakes are not repeated. He also shares valuable insights and practical advice in our dev channels, which benefits the entire team.\nMohamed communicates clearly and proactively, tackling both routine and urgent issues. He takes ownership of any problems within his scope and, in many cases, steps up beyond his immediate responsibilities. When working on tasks, Mohamed demonstrates strong technical expertise and a determined approach, always striving for the best possible results and actively contributing to the team's success.\nMohamed's leadership extends beyond just his technical abilities. He fosters a collaborative and positive team environment, always willing to lend a hand or share his knowledge with others. His approachable nature encourages open communication, making him someone the team can rely on not only for problem-solving but also for guidance and support. Mohamed's dedication to both individual and team growth ensures that everyone around him continues to learn and improve, fostering a culture of helpful developers throughout.",
    "date": "July 2025"
  },
  {
    "id": 40,
    "content": "Over the past three months, Mohamed has demonstrated strong leadership qualities, particularly in his role within the frontend team. He has shown exceptional patience and a genuine willingness to support his teammates by ensuring they stay updated with the latest insights, tricks, or changes that could impact their work.\nMohamed communicates in a clear, professional, and encouraging manner, especially when working with junior team members who may lack some of the information or experience he has. His positive attitude stands out  he approaches difficult tasks as challenges to learn from, not obstacles, and he consistently uplifts the team's morale with this mindset.\nHe’s also shown a strong sense of responsibility and emotional intelligence in how he deals with team dynamics, and I believe he’s on a great path to becoming a strong team leader both ethically and technically.",
    "date": "July 2025"
  },
  {
    "id": 41,
    "content": "To support his growth into a more senior leadership role, Mohamed could benefit from expanding the complexity of the tasks he works on. Tackling more advanced technical challenges and owning larger features end-to-end will help sharpen both his technical depth and decision making skills.",
    "date": "July 2025"
  }
]
